// დავალება:

// დაწერეთ შემდეგი სკრიპტი:
//  მოცემულია ცვლადი, რომლის მნიშვნელობაა 100.
// დაწერეთ if პირობა, თუ ცვლადის მბიშვნელობა ნაკლებია 50ზე დაუბეჭდოს - ნაკლებია 50ზე,
// თუ ცვლადის მნიშვნელობა მეტია 20ზე დაიბეჭდოს მეტია 20ზე, ყველა სხვა დანარჩენ შემთხვევაში დაიბეჭდოს - შეცდომა.

// მოცემულია ცვლადი, რომლის მნიშვნელობაა მარიამ. ახალი if ის სინტაქსით დაწერეთ,
//  თუ ცვლადის მნიშვნელობა უდრის მარიამ-ს დაიბეჭდოს - true, ყველა სხვა დანარჩენ შემთხვევაში დაიბეჭდოს - false;

// მოცემულია ცვლადი, რომლის მნიშვნელობაა მარიამ. switch case ის საშუალებით დაწერეთ,
// თუ ცვლადის მნიშვნელობა უდრის მარიამ-ს დაიბეჭდოს - true,ყველა სხვა დანარჩენ შემთხვევაში დაიბეჭდოს - false

let x = 100;

if (x < 50) {
    console.log("ნაკლებია 50-ზე");
} else if (x > 20) {
    console.log("მეტია 20-ზე");
} else {
    console.log("შეცდომა");
}

let y = "მარიამ";

// ვარიანტი 1
if (y == "მარიამ") {
    console.log("true");
} else {
    console.log("false");
}

// ვარიანტი 2
console.log(y == "მარიამ");

switch (y) {
    case "მარიამ":
        console.log("true");
        break;
    default:
        console.log("false")
}